## 행과 열 추출
- 열 추출
    - 하나의 열 : 데이터프레임[열이름]
    - 여러 열   : 데이터프레임[[열이름1, 열이름2]]
---
- 행 추출
    - 라벨
        - 하나의 행 : 데이터프레임[행이름1 : 행이름1]
        - 여러 행   : 데이터프레임[행이름1 : 행이름3]
    - 인덱스
        - 하나의 행 : 데이터프레임[인덱스 : 인덱스] -> 데이터프레임[0:1] - 1행 추출
        - 여러 행   : 데이터프레임[인덱스 : 인덱스] -> 데이터프레임[0:3] - 1 ~ 2행 추출

In [1]:
import pandas as pd

In [2]:
lt = [[], [], []]
for num in range(1,21):
    if num % 2 == 1:
        lt[0].append(num)
    elif num % 2 == 0:
        lt[1].append(num)
    if num*5 % 10 == 0:
        lt[2].append(num*5)
df = pd.DataFrame(data=lt, index=['row1', 'row2', 'row3'], columns=['co1', 'co2', 'co3', 'co4', 'co5', 'co6', 'co7', 'co8', 'co9', 'co10'])
df

      co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
row1    1    3    5    7    9   11   13   15   17    19
row2    2    4    6    8   10   12   14   16   18    20
row3   10   20   30   40   50   60   70   80   90   100

In [3]:
lt = [range(1,21,2), range(2,21,2), range(10,101,10)]
df = pd.DataFrame(data=lt, index=['row1', 'row2', 'row3'], columns=[f'co{idx}' for idx in range(1,11)])
df

      co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
row1    1    3    5    7    9   11   13   15   17    19
row2    2    4    6    8   10   12   14   16   18    20
row3   10   20   30   40   50   60   70   80   90   100

In [4]:
df.shape

df.shape[1]

(3, 10)

In [10]:
print(df.columns)
type(df.columns)

df.columns[0]

for co in df.columns:
    print(co)

Index(['co1', 'co2', 'co3', 'co4', 'co5', 'co6', 'co7', 'co8', 'co9', 'co10'], dtype='object')

pandas.core.indexes.base.Index

In [15]:
print(df.index)
print(type(df.index))
for idx in df.index:
    print(idx)

Index(['row1', 'row2', 'row3'], dtype='object')
<class 'pandas.core.indexes.base.Index'>
row1
row2
row3

In [22]:
df.dtypes

co1     int64
co2     int64
co3     int64
co4     int64
co5     int64
co6     int64
co7     int64
co8     int64
co9     int64
co10    int64
dtype: object

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, row1 to row3
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   co1     3 non-null      int64
 1   co2     3 non-null      int64
 2   co3     3 non-null      int64
 3   co4     3 non-null      int64
 4   co5     3 non-null      int64
 5   co6     3 non-null      int64
 6   co7     3 non-null      int64
 7   co8     3 non-null      int64
 8   co9     3 non-null      int64
 9   co10    3 non-null      int64
dtypes: int64(10)
memory usage: 372.0+ bytes

In [30]:
# df['co2']
type(df['co2'])

pandas.core.series.Series

In [42]:
df[['co2','co10']]
type(df[['co2','co10']])

pandas.core.frame.DataFrame

In [43]:
df[[f'co{idx}' for idx in range(1,4)]]

      co1  co2  co3
row1    1    3    5
row2    2    4    6
row3   10   20   30

In [49]:
df[0:1]

      co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
row1    1    3    5    7    9   11   13   15   17    19

In [50]:
df[-1:]

      co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
row3   10   20   30   40   50   60   70   80   90   100

In [58]:
# df[:2][['co4', 'co5']]
# df[['co4', 'co5']][:2]
# df[:2]['co4']
df['co4'][:1]

row1    7
Name: co4, dtype: int64